name: "ocr_pipeline"
backend: "python"
max_batch_size: 1
input [
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]
output [
  {
    name: "CODES"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "CONFIDENCES"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 2
  }
]
